

// Шахматная доска
// Вводим ширину
var len = +process.argv[2]; 
// Вводим высоту
var alt = +process.argv[3];

// Делаем цикл сколько надо всего линий сделать по вертикали
 for( var i=0; i < alt; i++){
    var str = '';
 // если это первая линия или последняя, то рисуем ----
    if( i==0 || i==alt-1 ){

        for(var j=0; j<len; j++){
            str+='-'+'-';
        }

    }else{
// если это ряд в середине, то в начале и конце рисуем |
        str+='|';
        for(var k=0; k<len-1; k++){
// если это ряд в середине, то для четных рисуем _*, для нечетных наоборот
            if(i%2==0){
                str += '_' + '#';
            }else{
                str += '#' + '_';
            }
       
    }
    str+='|';

    }
    console.log(str);
 }
